Revit 2026 API

# AnalyticalElementSetTransform Method

---

Sets the transform of Analytical Element Local Coordinate System.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetTransform(
	Transform trf
)
```
```vb
Public Sub SetTransform (
	trf As Transform
)
```
```cpp
public:
void SetTransform(
	Transform^ trf
)
```
```fsharp
member SetTransform :
        trf : Transform -> unit
```

#### Parameters

trf Transform

| Exception | Condition |
| --- | --- |
| ArgumentException | The provided transformation for Local Coordinate System is not valid. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalyticalElement Class

Autodesk.Revit.DB.Structure Namespace